fix: diargamas mermaid
